/*************************************************************************
* @ 서비스경로 : FND34P
* @ 파일명      : FND34P 펀드 > 펀드 상세 > 펀드 > 투자에 따른 위험
* @ 화면ID	  : PBWFU049904
* @ 작성자      : 90195654
* @ 작성일      : 2025-01-13
************************** 수정이력 ****************************************
* 날짜                    작업자                 변경내용
*_________________________________________________________________________
* 2025-01-13            90195654                 최초작성
*************************************************************************/

import { BaseModule } from '../cmm/BaseModule.js';

export class FND34P extends BaseModule {
	
    constructor(elem) {
        
    	super(elem)
    }

    init () {
    	
    	super.init(this);
  
    }
    
    register() {
    	
    }
    
    destroy () {
        super.destroy(this);
    }
}
